buoyantCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;
b 100;

vertices
(
    ( 0 0 0)
    ($b 0 0)
    ($b $b 0)
    ( 0 $b 0)
    ( 0 0 10)
    ($b 0 10)
    ($b $b 10)
    ( 0 $b 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 5) simpleGrading (1 1 1)
);

boundary
(
    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    cold
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    hot    
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

// ************************************************************************* //
